
reset_phone_data = (
    {'reset': '18211111134', 'password': '123456'},  # 已注册手机
    {'reset': '16573562213', 'password': '123456'},  # 未注册手机号
    {'reset': '11111111111', 'password': '123456', 'toast': '手机号 格式不正确'},
    {'reset': '16573562213', 'password': '123456', 'toast':  '手机号码不能与原号码相同'},
    {'reset': '17711110000', 'password': '123456'},  # 恢复测试数据
)

# 验证码验证失败
reset_again_data = (
    {'reset': '18211111003', 'password': '123456'},  # 未注册手机号
    {'reset': '18711111234', 'password': '123456'},  # 恢复测试数据
)
